Revit 2027 API
WaterLoopData Properties
The WaterLoopData type exposes the following members.
Properties
Name | Description
ChillerType |  The type of water chiller. Note this property change would reset the condenser water loop.
CondenserWaterLoopId |  The water loop element id for the water cooled chiller.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
WaterLoopType |  The type of water loop. Note this property change would reset other properties.
Top
See Also
Reference
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace